Q1. Create an array having consecutive natural numbers of size 6x3 and print it

In [2]:
import numpy as np
import os
import pandas as pd

In [3]:
arr=np.arange(1,19).reshape(6,3)
arr

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12],
       [13, 14, 15],
       [16, 17, 18]])

In [5]:
df=pd.read_excel("D:\\breast cancer\\Week 1 Dataset.xlsx")

In [6]:
df.head()

  Name  Income per month          State  Age Sex  Number of siblings
0    A                50     Tamil Nadu   23   M                   0
1    B                34      Karnataka   37   F                   3
2    C                54     Tamil Nadu   35   F                   1
3    D                24  Uttar Pradesh   26   F                   4
4    E                19          Bihar   59   M                   5


Q2: Rename alll the coumns in the dataset as per your wish and save it in another dataframe and name it df2

In [7]:
df2=df.rename(columns={'Name':'name','Income per month':'income_per_mon','State':'state','Age':'age','Sex':'gender','Number of siblings':'num_of_siblings'})
df2

  name  income_per_mon          state  age gender  num_of_siblings
0    A              50     Tamil Nadu   23      M                0
1    B              34      Karnataka   37      F                3
2    C              54     Tamil Nadu   35      F                1
3    D              24  Uttar Pradesh   26      F                4
4    E              19          Bihar   59      M                5
5    F              21          Bihar   48      M                6
6    G              40          Delhi   30      F                2
7    H              20  Uttar Pradesh   72      M               10
8    I              30      Telangana   22      F                0
9    J              18    Chattisgarh   42      M                7

Q3: After you have created df2, make the same changes in the original dataframe using the inplace.

In [8]:
df.rename(columns={'Name':'name','Income per month':'income_per_mon','State':'state','Age':'age','Sex':'gender','Number of siblings':'num_of_siblings'},inplace=True)
df

  name  income_per_mon          state  age gender  num_of_siblings
0    A              50     Tamil Nadu   23      M                0
1    B              34      Karnataka   37      F                3
2    C              54     Tamil Nadu   35      F                1
3    D              24  Uttar Pradesh   26      F                4
4    E              19          Bihar   59      M                5
5    F              21          Bihar   48      M                6
6    G              40          Delhi   30      F                2
7    H              20  Uttar Pradesh   72      M               10
8    I              30      Telangana   22      F                0
9    J              18    Chattisgarh   42      M                7

Q4: Show only the columns information, sex and number of siblings.

In [9]:
df.iloc[0:5,4:6]

  gender  num_of_siblings
0      M                0
1      F                3
2      F                1
3      F                4
4      M                5


Q5: Use iloc method to print data from column 1 to 4 and rows 3 to 9

In [23]:
df.iloc[3:10,1:5]

   income_per_mon          state  age gender
3              24  Uttar Pradesh   26      F
4              19          Bihar   59      M
5              21          Bihar   48      M
6              40          Delhi   30      F
7              20  Uttar Pradesh   72      M
8              30      Telangana   22      F
9              18    Chattisgarh   42      M

Q6: Find the total value count of number of siblings in the given dataset

In [24]:
df['num_of_siblings'].value_counts

<bound method IndexOpsMixin.value_counts of 0     0
1     3
2     1
3     4
4     5
5     6
6     2
7    10
8     0
9     7
Name: num_of_siblings, dtype: int64>

Q7: What are dependent and independent varibles in our dataset?

Ans : In my opinion, number of siblings will be dependent variable(y) and income, age , gender will be our independent variable

Q8: Mention all your finding from the above given heatmap.

Ans: Heatmap or correlation plot describes how our variables or to be precise how our dependent and independent variables co-relate with each other. The collinearity is measured between -1 to 1. The color variation help us to easily identify which of the variables corelate with each other and how much. If we see the block where income per month is being compared with number of siblings we see a dark color which indicates how highly they are corelated. Similar situation can be seen when age is compared with number of siblings where the color is peach and if scale the color on the right side we conclude that they both are highly corelated having 86%  percentage of collinearity